#include "mainwindow.h"

#include <QApplication>
/*
                     _ooOoo_
                    o8888888o
                    88" . "88
                    (| -_- |)
                     O\ = /O
                 ____/`---'\____
               .   ' \\| |// `.
                / \\||| : |||// \
              / _||||| -:- |||||- \
                | | \\\ - /// | |
              | \_| ''\---/'' | |
               \ .-\__ `-` ___/-. /
            ___`. .' /--.--\ `. . __
         ."" '< `.___\_<|>_/___.' >'"".
        | | : `- \`.;`\ _ /`;.`/ - ` : | |
          \ \ `-. \_ __\ /__ _/ .-` / /
  ======`-.____`-.___\_____/___.-`____.-'======
                     `=---='

  .............................................
           佛祖保佑             永无BUG
 */

int main(int argc, char *argv[])
{
    QApplication a(argc, argv);
    MainWindow w;

    QIcon icon(":/icons/icons/logo.ico");
    w.setWindowIcon(icon);
    w.setWindowTitle("基于QT的多参数生理信号采集上位机 Ver:1.0.5");
    w.show();
    return a.exec();
}

/*
更新日志
2024.11.2 Ver:1.0.5
主界面UI重绘
加入软件说明页(待完善)
增加适配蓝牙无线串口功能
修复全屏下无法自适应的bug
2024.10.31 Ver:1.0.1
修复独立通道无法清除的bug
优化独立通道的x轴自适应模式
加入赛博大佛防止电子bug刷新
2024.9.5 Ver:0.9.9
进行发布前的版本优化
修复若干bug
编写readme文件
修改UI和logo
2024.9.5 Ver:0.9.5
修复了若干bug
实现了通道名、包头包尾自定义功能
实现独立通道波形图例名称自定义
2024.9.3 Ver:0.8.0
修改了UI布局
增加了多通道独立显示的UI等
提升为widget后使用样式表规定边框
2024.9.1 Ver:0.5.0
串口助手demo
*/
